streetartist/esp32p4_nuttx/arch/risc-v/src/common/espressif/esp_i2c.c
/****************************************************************************
 * arch/risc-v/src/common/espressif/esp_i2c.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_ESPRESSIF_I2C_PERIPH_MASTER_MODE

#include <sys/types.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>
#include <time.h>
#include <sys/time.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/clock.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/i2c/i2c_master.h>

#include <arch/board/board.h>

#include "esp_i2c.h"
#include "esp_irq.h"
#include "esp_gpio.h"
#include "riscv_internal.h"

#include "periph_ctrl.h"
#include "hal/i2c_hal.h"
#include "hal/i2c_types.h"
#include "hal/i2c_ll.h"
#include "soc/system_reg.h"
#include "soc/gpio_sig_map.h"
#include "hal/i2c_periph.h"
#include "esp_clk_tree.h"
#if defined(CONFIG_ARCH_CHIP_ESP32H2) || defined(CONFIG_ARCH_CHIP_ESP32C6)
#  include "soc/pcr_reg.h"
#endif
#if defined(CONFIG_ESPRESSIF_LP_I2C0)
#  include "driver/rtc_io.h"
#  include "hal/rtc_io_hal.h"
#  include "io_mux.h"
#  include "lp_core_i2c.h"
#  include "soc/i2c_struct.h"
#  include "driver/lp_io.h"
#endif
#ifdef CONFIG_PM
#  include "include/esp_pm.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if defined(CONFIG_ESPRESSIF_LP_I2C0)
#  define ESP_LP_I2C0_ID     LP_I2C_NUM_0
#else
#  define ESP_LP_I2C0_ID     I2C_NUM_MAX
#endif

#define GET_STATUS(hw) hw->sr.val

#define ESPRESSIF_I2CTIMEOTICKS \
    (SEC2TICK(CONFIG_ESPRESSIF_I2CTIMEOSEC) + MSEC2TICK(CONFIG_ESPRESSIF_I2CTIMEOMS))

/* I2C hardware FIFO depth */

#define I2C_FIFO_SIZE (32)

/* Number of bus cycles filtered by default */

#define I2C_FILTER_CYC_NUM_DEF (7)

/* Number of bus cycles for the master to generate when the slave is in
 * deadlock
 */

#define I2C_SCL_CYC_NUM_DEF (9)

/* I2C default clock frequency */

#define I2C_CLK_FREQ_DEF (100 * 1000)

/* Mask for the interrupt errors */

#define I2C_INT_ERR_MASK (I2C_NACK_INT_ENA_M | \
                          I2C_TIME_OUT_INT_ENA_M | \
                          I2C_ARBITRATION_LOST_INT_ENA_M)

/* I2C event trace logic.
 * NOTE: trace uses the internal, non-standard, low-level debug interface
 * syslog() but does not require that any other debug is enabled.
 */

#ifndef CONFIG_I2C_TRACE
#  define esp_i2c_tracereset(p)
#  define esp_i2c_tracenew(p,s)
#  define esp_i2c_traceevent(p,e,a,s)
#  define esp_i2c_tracedump(p)
#endif

#ifndef CONFIG_I2C_NTRACE
#  define CONFIG_I2C_NTRACE 32
#endif

/* Time to wait for the bus to be cleared */

#define I2C_CLR_BUS_TIMEOUT_MS (50)

/* SCL timeout value in microseconds */

#define SCL_TIMEOUT_VAL_US (CONFIG_ESPRESSIF_I2CTIMEOMS * 1000)

#if SOC_PERIPH_CLK_CTRL_SHARED
#  define I2C_CLOCK_SRC_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#  define I2C_CLOCK_SRC_ATOMIC()
#endif

#if !SOC_RCC_IS_INDEPENDENT
#  define I2C_RCC_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#  define I2C_RCC_ATOMIC()
#endif

#if SOC_LP_I2C_SUPPORTED
#  define LP_I2C_SRC_CLK_ATOMIC()    PERIPH_RCC_ATOMIC()
#  define LP_I2C_BUS_CLK_ATOMIC()    PERIPH_RCC_ATOMIC()
#endif

#define SCL_PIN_ATTR (FUNCTION_2 || INPUT_PULLUP || OUTPUT_OPEN_DRAIN)
#define SDA_PIN_ATTR (FUNCTION_2 || INPUT_PULLUP || OUTPUT_OPEN_DRAIN)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* I2C state */

enum esp_i2cstate_e
{
  I2CSTATE_IDLE = 0,
  I2CSTATE_PROC,
  I2CSTATE_STOP,
#ifndef CONFIG_I2C_POLLED
  I2CSTATE_FINISH,
#endif
  I2CSTATE_ERROR
};

/* I2C hardware command */

enum esp_i2c_opmode_e
{
  I2C_CMD_RESTART = 6, /* I2C restart command */
  I2C_CMD_WRITE = 1,   /* I2C write command */
  I2C_CMD_READ = 3,    /* I2C read command */
  I2C_CMD_STOP = 2,    /* I2C stop command */
  I2C_CMD_END = 4      /* I2C end command */
};

#ifdef CONFIG_I2C_TRACE

/* Trace events */

enum esp_trace_e
{
  I2CEVENT_NONE = 0,  /* No events have occurred with this status */
  I2CEVENT_SENDADDR,  /* Start/Master bit set and address sent, param = addr */
  I2CEVENT_SENDBYTE,  /* Send byte, param = bytes */
  I2CEVENT_RCVMODEEN, /* Receive mode enabled, param = 0 */
  I2CEVENT_RCVBYTE,   /* Read more dta, param = bytes */
  I2CEVENT_STOP,      /* Last byte sten, send stop, param = length */
  I2CEVENT_ERROR      /* Error occurred, param = 0 */
};

/* Trace data */

struct esp_trace_s
{
  uint32_t status;           /* I2C 32-bit SR status */
  uint32_t count;            /* Interrupt count when status change */
  enum esp_i2cstate_e event; /* Last event that occurred with this status */
  uint32_t parm;             /* Parameter associated with the event */
  clock_t time;              /* First of event or first status */
};

