streetartist/esp32p4_nuttx/arch/risc-v/src/common/espressif/esp_i2c.c
#endif /* CONFIG_I2C_TRACE */

/* I2C Device hardware configuration */

struct esp_i2c_config_s
{
  uint32_t clk_freq;    /* Clock frequency */
  uint8_t scl_pin;      /* GPIO configuration for SCL as SCL */
  uint8_t sda_pin;      /* GPIO configuration for SDA as SDA */
};

/* I2C Device Private Data */

struct esp_i2c_priv_s
{
  const struct i2c_ops_s *ops; /* Standard I2C operations */

  uint32_t id;                 /* I2C instance */

  /* Port configuration */

  struct esp_i2c_config_s *config;
  int refs;                    /* Reference count */
  mutex_t lock;                /* Mutual exclusion mutex */

#ifndef CONFIG_I2C_POLLED
  sem_t sem_isr;               /* Interrupt wait semaphore */
#endif

  /* I2C work state (see enum esp_i2cstate_e) */

  volatile enum esp_i2cstate_e i2cstate;

  struct i2c_msg_s *msgv;      /* Message list */

  uint8_t msgid;               /* Current message ID */
  ssize_t bytes;               /* Processed data bytes */

#ifndef CONFIG_I2C_POLLED
  int cpuint;                  /* CPU interrupt assigned to this I2C */
#endif

  uint32_t error;              /* I2C transform error */

  bool ready_read;             /* If I2C is ready for receiving data */

  soc_module_clk_t clk_src;   /* Clock source */

  uint32_t clk_freq;           /* Current I2C Clock frequency */

  /* I2C trace support */

#ifdef CONFIG_I2C_TRACE
  int tndx;                    /* Trace array index */
  clock_t start_time;          /* Time when the trace was started */

  /* The actual trace data */

  struct esp_trace_s trace[CONFIG_I2C_NTRACE];

#endif
  i2c_hal_context_t *ctx;     /* Common layer struct */
#ifdef CONFIG_PM
  esp_pm_lock_handle_t pm_lock; /* Power management lock */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void esp_i2c_reset_fifo(struct esp_i2c_priv_s *priv);
static void esp_i2c_intr_enable(struct esp_i2c_priv_s *priv);
static void esp_i2c_intr_enable(struct esp_i2c_priv_s *priv);
static void esp_i2c_intr_disable(struct esp_i2c_priv_s *priv);
static void esp_i2c_sendstart(struct esp_i2c_priv_s *priv);
static void esp_i2c_senddata(struct esp_i2c_priv_s *priv);
static void esp_i2c_recvdata(struct esp_i2c_priv_s *priv);
static void esp_i2c_startrecv(struct esp_i2c_priv_s *priv);
static void esp_i2c_sendstop(struct esp_i2c_priv_s *priv);
static void esp_i2c_init_clock(struct esp_i2c_priv_s *priv,
                               uint32_t bus_freq);
static void esp_i2c_init(struct esp_i2c_priv_s *priv);
static void esp_i2c_deinit(struct esp_i2c_priv_s *priv);
static void esp_i2c_reset_fsmc(struct esp_i2c_priv_s *priv);
static int esp_i2c_sem_waitdone(struct esp_i2c_priv_s *priv);
#ifdef CONFIG_I2C_POLLED
static int esp_i2c_polling_waitdone(struct esp_i2c_priv_s *priv);
#endif /* CONFIG_I2C_POLLED */
static int  esp_i2c_transfer(struct i2c_master_s *dev,
                             struct i2c_msg_s *msgs,
                             int count);
#ifdef CONFIG_I2C_RESET
static void esp_i2c_clear_bus(struct esp_i2c_priv_s *priv);
static int  esp_i2c_reset(struct i2c_master_s *dev);
#endif /* CONFIG_I2C_RESET */
#ifdef CONFIG_I2C_TRACE
static void esp_i2c_traceclear(struct esp_i2c_priv_s *priv);
static void esp_i2c_tracereset(struct esp_i2c_priv_s *priv);
static void esp_i2c_tracenew(struct esp_i2c_priv_s *priv,
                             uint32_t status);
static void esp_i2c_traceevent(struct esp_i2c_priv_s *priv,
                               enum esp_trace_e event,
                               uint32_t parm,
                               uint32_t status);
static void esp_i2c_tracedump(struct esp_i2c_priv_s *priv);
#endif /* CONFIG_I2C_TRACE */
#ifndef CONFIG_I2C_POLLED
static int esp_i2c_irq(int cpuint, void *context, void *arg);
#endif /* CONFIG_I2C_POLLED */
static inline void esp_i2c_process(struct esp_i2c_priv_s *priv,
                                   uint32_t status);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* I2C interface */

static const struct i2c_ops_s esp_i2c_ops =
{
  .transfer = esp_i2c_transfer
#ifdef CONFIG_I2C_RESET
  , .reset  = esp_i2c_reset
#endif
};

#ifdef CONFIG_ESPRESSIF_I2C0_MASTER_MODE

i2c_hal_context_t i2c0_ctx =
{
  0
};

/* I2C device structure */

static struct esp_i2c_config_s esp_i2c0_config =
{
  .clk_freq   = I2C_CLK_FREQ_DEF,
  .scl_pin    = CONFIG_ESPRESSIF_I2C0_SCLPIN,
  .sda_pin    = CONFIG_ESPRESSIF_I2C0_SDAPIN,
};

static struct esp_i2c_priv_s esp_i2c0_priv =
{
  .ops        = &esp_i2c_ops,
  .id         = 0,
  .config     = &esp_i2c0_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .i2cstate   = I2CSTATE_IDLE,
  .msgv       = NULL,
  .msgid      = 0,
  .bytes      = 0,
#ifndef CONFIG_I2C_POLLED
  .cpuint     = -ENOMEM,
#endif
  .error      = 0,
  .ready_read = false,
  .clk_src    = I2C_CLK_SRC_DEFAULT,
  .clk_freq   = 0,
  .ctx        = &i2c0_ctx,
#ifdef CONFIG_PM
  .pm_lock    = NULL,
#endif
};
#endif

#ifdef CONFIG_ESPRESSIF_I2C1_MASTER_MODE
#  if SOC_HP_I2C_NUM > 1
i2c_hal_context_t i2c1_ctx =
{
  0
};

/* I2C device structure */

static struct esp_i2c_config_s esp_i2c1_config =
{
  .clk_freq   = I2C_CLK_FREQ_DEF,
  .scl_pin    = CONFIG_ESPRESSIF_I2C1_SCLPIN,
  .sda_pin    = CONFIG_ESPRESSIF_I2C1_SDAPIN,
};

static struct esp_i2c_priv_s esp_i2c1_priv =
{
  .ops        = &esp_i2c_ops,
  .id         = 1,
  .config     = &esp_i2c1_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .i2cstate   = I2CSTATE_IDLE,
  .msgv       = NULL,
  .msgid      = 0,
  .bytes      = 0,
#ifndef CONFIG_I2C_POLLED
  .cpuint     = -ENOMEM,
#endif
  .error      = 0,
  .ready_read = false,
  .clk_src    = I2C_CLK_SRC_DEFAULT,
  .clk_freq   = 0,
  .ctx        = &i2c1_ctx,
#ifdef CONFIG_PM
  .pm_lock    = NULL,
#endif
};
#  else
#    error "This device contains only a single HP I2C port."
#  endif /* SOC_HP_I2C_NUM > 0 */
#endif /* CONFIG_ESPRESSIF_I2C1 */

