streetartist/esp32p4_nuttx/arch/risc-v/src/common/espressif/esp_i2c.c
#ifdef CONFIG_ESPRESSIF_LP_I2C0
#  if SOC_LP_I2C_NUM > 0
i2c_hal_context_t lp_i2c0_ctx =
{
  0
};

/* I2C device structure */

static struct esp_i2c_config_s esp_lp_i2c0_config =
{
  .clk_freq   = I2C_CLK_FREQ_DEF,
  .scl_pin    = CONFIG_ESPRESSIF_LPI2C0_SCLPIN,
  .sda_pin    = CONFIG_ESPRESSIF_LPI2C0_SDAPIN,
};

static struct esp_i2c_priv_s esp_lp_i2c0_priv =
{
  .ops        = &esp_i2c_ops,
  .id         = LP_I2C_NUM_0,
  .config     = &esp_lp_i2c0_config,
  .refs       = 0,
  .lock       = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr    = SEM_INITIALIZER(0),
#endif
  .i2cstate   = I2CSTATE_IDLE,
  .msgv       = NULL,
  .msgid      = 0,
  .bytes      = 0,
#ifndef CONFIG_I2C_POLLED
  .cpuint     = -ENOMEM,
#endif
  .error      = 0,
  .ready_read = false,
  .clk_src    = LP_I2C_SCLK_DEFAULT,
  .clk_freq   = 0,
  .ctx        = &lp_i2c0_ctx,
#ifdef CONFIG_PM
  .pm_lock    = NULL,
#endif
};
#  else
#    error "This device does not contain a LP I2C port."
#  endif /* SOC_LP_I2C_NUM > 0 */
#endif /* CONFIG_ESPRESSIF_LP_I2C0 */

/* Trace events strings */

#ifdef CONFIG_I2C_TRACE
static const char *g_trace_names[] =
{
  "NONE      ",
  "SENDADDR  ",
  "SENDBYTE  ",
  "RCVMODEEN ",
  "RCVBYTE   ",
  "STOP      ",
  "ERROR     "
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_i2c_reset_fifo
 *
 * Description:
 *   Reset I2C RX and TX hardware FIFO.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_reset_fifo(struct esp_i2c_priv_s *priv)
{
  i2c_ll_txfifo_rst(priv->ctx->dev);
  i2c_ll_rxfifo_rst(priv->ctx->dev);
}

/****************************************************************************
 * Name: esp_i2c_intr_enable
 *
 * Description:
 *   Enable I2C interrupts.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_intr_enable(struct esp_i2c_priv_s *priv)
{
  i2c_ll_clear_intr_mask(priv->ctx->dev, I2C_LL_INTR_MASK);
  i2c_ll_enable_intr_mask(priv->ctx->dev, I2C_LL_MASTER_EVENT_INTR);
}

/****************************************************************************
 * Name: esp_i2c_intr_disable
 *
 * Description:
 *   Disable I2C interrupts.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_intr_disable(struct esp_i2c_priv_s *priv)
{
  i2c_ll_disable_intr_mask(priv->ctx->dev, I2C_LL_INTR_MASK);
  i2c_ll_clear_intr_mask(priv->ctx->dev, I2C_LL_INTR_MASK);
}

/****************************************************************************
 * Name: esp_i2c_sendstart
 *
 * Description:
 *   Send I2C start signal.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_sendstart(struct esp_i2c_priv_s *priv)
{
  struct i2c_msg_s *msg = &priv->msgv[priv->msgid];
  uint32_t fifo_val = 0;
  i2c_ll_hw_cmd_t restart_cmd =
    {
      .op_code = I2C_LL_CMD_RESTART
    };

  i2c_ll_hw_cmd_t write_cmd =
    {
      .byte_num = 1,
      .ack_en = 1,
      .op_code = I2C_LL_CMD_WRITE
    };

  i2c_ll_hw_cmd_t end_cmd =
    {
      .op_code = I2C_LL_CMD_END
    };

  /* Write I2C command registers */

  i2c_ll_master_write_cmd_reg(priv->ctx->dev, restart_cmd, 0);
  i2c_ll_master_write_cmd_reg(priv->ctx->dev, write_cmd, 1);
  i2c_ll_master_write_cmd_reg(priv->ctx->dev, end_cmd, 2);

  /* Write data to FIFO register */

  fifo_val = (msg->addr << 1) | (msg->flags & I2C_M_READ);
  i2c_ll_write_txfifo(priv->ctx->dev, (uint8_t *)&fifo_val, 1);

  /* Enable I2C master TX interrupt */

  esp_i2c_intr_enable(priv);

  /* Update I2C configuration */

  /* Configure the I2C to trigger a transaction */

  i2c_hal_master_trans_start(priv->ctx);
}

/****************************************************************************
 * Name: esp_i2c_senddata
 *
 * Description:
 *   Send I2C data.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_senddata(struct esp_i2c_priv_s *priv)
{
  struct i2c_msg_s *msg = &priv->msgv[priv->msgid];
  int n = msg->length - priv->bytes;
  i2c_ll_hw_cmd_t write_cmd =
    {
      .ack_en = 1,
      .op_code = I2C_LL_CMD_WRITE
    };

  i2c_ll_hw_cmd_t end_cmd =
    {
      .op_code = I2C_LL_CMD_END
    };

  n = n < I2C_FIFO_SIZE ? n : I2C_FIFO_SIZE;

  write_cmd.byte_num = n;
  i2c_ll_master_write_cmd_reg(priv->ctx->dev, write_cmd, 0);
  i2c_ll_master_write_cmd_reg(priv->ctx->dev, end_cmd, 1);
  i2c_ll_write_txfifo(priv->ctx->dev, &msg->buffer[priv->bytes], n);
  i2c_ll_master_enable_tx_it(priv->ctx->dev);

  priv->bytes += n;

  /* Enable I2C master TX interrupt */

  esp_i2c_intr_enable(priv);

  /* Update I2C configuration */

  /* Configure the I2C to trigger a transaction */

  i2c_hal_master_trans_start(priv->ctx);
}

/****************************************************************************
 * Name: esp_i2c_recvdata
 *
 * Description:
 *   Transfer data from the FIFO to the driver buffer.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_recvdata(struct esp_i2c_priv_s *priv)
{
  struct i2c_msg_s *msg = &priv->msgv[priv->msgid];
  uint32_t cmd = 0;
  uint8_t n = 0;
  uint32_t data = 0;

  i2c_ll_get_rxfifo_cnt(priv->ctx->dev, &cmd);
  n = cmd & 0xff;

  i2c_ll_read_rxfifo(priv->ctx->dev, &msg->buffer[priv->bytes], n);
  i2c_ll_master_enable_rx_it(priv->ctx->dev);

  priv->bytes += n;
}

/****************************************************************************
 * Name: esp_i2c_startrecv
 *
 * Description:
 *   Configure I2C to prepare receiving data and it will create an interrupt
 *   to receive real data.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

