streetartist/esp32p4_nuttx/arch/risc-v/src/common/espressif/esp_i2c.c
static void esp_i2c_startrecv(struct esp_i2c_priv_s *priv)
{
  int ack_value = 0;
  struct i2c_msg_s *msg = &priv->msgv[priv->msgid];
  int n = msg->length - priv->bytes;
  i2c_ll_hw_cmd_t read_cmd =
    {
      0
    };

  i2c_ll_hw_cmd_t end_cmd =
    {
      0
    };

  if (n > 1)
    {
      n -= 1;
      n = n < I2C_FIFO_SIZE ? n : I2C_FIFO_SIZE;
      ack_value = 0;
    }
  else
    {
      ack_value = 1;
    }

  read_cmd.byte_num = n;
  read_cmd.ack_val = ack_value;
  read_cmd.op_code = I2C_LL_CMD_READ;
  i2c_ll_master_write_cmd_reg(priv->ctx->dev, read_cmd, 0);

  end_cmd.op_code = I2C_LL_CMD_END;
  i2c_ll_master_write_cmd_reg(priv->ctx->dev, end_cmd, 1);

  /* Enable I2C master RX interrupt */

  esp_i2c_intr_enable(priv);

  /* Update I2C configuration */

  /* Configure the I2C to trigger a transaction */

  i2c_hal_master_trans_start(priv->ctx);
}

/****************************************************************************
 * Name: esp_i2c_sendstop
 *
 * Description:
 *   Send I2C STOP signal.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_sendstop(struct esp_i2c_priv_s *priv)
{
  i2c_ll_hw_cmd_t stop_cmd =
    {
      .op_code = I2C_LL_CMD_STOP
    };

  i2c_ll_master_write_cmd_reg(priv->ctx->dev, stop_cmd, 0);

  /* Enable I2C master TX interrupt */

  esp_i2c_intr_enable(priv);

  /* Update I2C configuration */

  /* Configure the I2C to trigger a transaction */

  i2c_hal_master_trans_start(priv->ctx);
}

/****************************************************************************
 * Name: esp_i2c_init_clock
 *
 * Description:
 *   Initialize I2C hardware clock.
 *
 * Parameters:
 *   priv     - Pointer to the internal driver state structure.
 *   bus_freq - Clock frequency of the I2C bus in Hz.
 *
 ****************************************************************************/

static void esp_i2c_init_clock(struct esp_i2c_priv_s *priv,
                               uint32_t bus_freq)
{
  uint32_t src_clk_frequency = 0;

  if (bus_freq == priv->clk_freq)
    {
      return ;
    }

  esp_clk_tree_src_get_freq_hz(priv->clk_src,
                               ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX,
                               &src_clk_frequency);

  I2C_CLOCK_SRC_ATOMIC()
    {
      i2c_hal_set_bus_timing(priv->ctx, bus_freq,
                             priv->clk_src, src_clk_frequency);
    }

  i2c_hal_master_set_scl_timeout_val(priv->ctx, SCL_TIMEOUT_VAL_US,
                                     src_clk_frequency);

#ifdef CONFIG_ESPRESSIF_LPI2C
  LP_I2C_SRC_CLK_ATOMIC()
    {
      lp_i2c_ll_set_source_clk(priv->ctx->dev, priv->clk_src);
    }
#else
  I2C_CLOCK_SRC_ATOMIC()
    {
      i2c_ll_set_source_clk(priv->ctx->dev, priv->clk_src);
    }
#endif

  i2c_ll_update(priv->ctx->dev);
  priv->clk_freq = bus_freq;
}

#ifdef CONFIG_ESPRESSIF_LPI2C
/****************************************************************************
 * Name: esp_lp_i2c_config_io
 *
 * Description:
 *   Configures LP I2C pin.
 *
 * Parameters:
 *   priv      - Pointer to the private driver struct.
 *   pin       - Pin number to configure.
 *
 * Return Value:
 *   None.
 *
 ****************************************************************************/

static void esp_lp_i2c_config_io(const struct esp_i2c_priv_s *priv,
                                 int8_t pin)
{
  int lp_pin = rtc_io_num_map[pin];

  DEBUGASSERT(lp_pin != -1);

  rtc_gpio_set_level(pin, 1);
  rtc_gpio_init(pin);

  rtc_gpio_set_direction(pin, RTC_GPIO_MODE_INPUT_OUTPUT_OD);
  rtc_gpio_pulldown_dis(pin);
  rtc_gpio_pullup_en(pin);
}
#endif /* CONFIG_ESPRESSIF_LPI2C */

/****************************************************************************
 * Name: esp_i2c_init
 *
 * Description:
 *   Initialize I2C hardware.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_init(struct esp_i2c_priv_s *priv)
{
  const struct esp_i2c_config_s *config = priv->config;

  if (priv->id < ESP_LP_I2C0_ID)
    {
      uint32_t scl_in_sig = i2c_periph_signal[priv->id].scl_in_sig;
      uint32_t scl_out_sig = i2c_periph_signal[priv->id].scl_out_sig;
      uint32_t sda_in_sig = i2c_periph_signal[priv->id].sda_in_sig;
      uint32_t sda_out_sig = i2c_periph_signal[priv->id].sda_out_sig;

      I2C_RCC_ATOMIC()
        {
          i2c_ll_enable_bus_clock(priv->id, true);
          i2c_ll_reset_register(priv->id);
        }

      I2C_CLOCK_SRC_ATOMIC()
        {
          i2c_hal_init(priv->ctx, priv->id);
        }

      /* Configure GPIO signals for I2C SCL and SDA pins */

      esp_gpiowrite(config->scl_pin, 1);
      esp_gpiowrite(config->sda_pin, 1);

      esp_configgpio(config->scl_pin, SCL_PIN_ATTR);
      esp_gpio_matrix_out(config->scl_pin, scl_out_sig, 0, 0);
      esp_gpio_matrix_in(config->scl_pin, scl_in_sig, 0);

      esp_configgpio(config->sda_pin, SDA_PIN_ATTR);
      esp_gpio_matrix_out(config->sda_pin, sda_out_sig, 0, 0);
      esp_gpio_matrix_in(config->sda_pin, sda_in_sig, 0);
    }
#ifdef CONFIG_ESPRESSIF_LPI2C
  else
    {
      LP_I2C_BUS_CLK_ATOMIC()
        {
          /* Enable LP I2C bus clock */

          lp_i2c_ll_enable_bus_clock(priv->id - LP_I2C_NUM_0, true);

          /* Reset LP I2C register */

          lp_i2c_ll_reset_register(priv->id - LP_I2C_NUM_0);
        }

      I2C_CLOCK_SRC_ATOMIC()
        {
          i2c_hal_init(priv->ctx, priv->id);
        }

      esp_lp_i2c_config_io(priv, config->scl_pin);
      esp_lp_i2c_config_io(priv, config->sda_pin);
      const i2c_signal_conn_t *p_i2c_pin = &i2c_periph_signal[priv->id];
#if !SOC_LP_GPIO_MATRIX_SUPPORTED
      rtc_gpio_iomux_func_sel(config->sda_pin, p_i2c_pin->iomux_func);
      rtc_gpio_iomux_func_sel(config->scl_pin, p_i2c_pin->iomux_func);
#else
      lp_gpio_connect_out_signal(config->sda_pin, p_i2c_pin->sda_out_sig, 0,
                                 0);
      lp_gpio_connect_in_signal(config->sda_pin, p_i2c_pin->sda_in_sig, 0);
      lp_gpio_connect_out_signal(config->scl_pin, p_i2c_pin->scl_out_sig, 0,
                                 0);
      lp_gpio_connect_in_signal(config->scl_pin, p_i2c_pin->scl_in_sig, 0);
#endif /* SOC_LP_GPIO_MATRIX_SUPPORTED */
    }
#endif

  /* Initialize I2C Master  */

