streetartist/esp32p4_nuttx/arch/risc-v/src/common/espressif/esp_i2c.c
  i2c_hal_master_init(priv->ctx);

  i2c_ll_update(priv->ctx->dev);

  /* Initialize I2C bus clock */

  esp_i2c_init_clock(priv, config->clk_freq);

  /* Disable I2C interrupts */

  esp_i2c_intr_disable(priv);

  /* Configure the hardware filter function */

  i2c_ll_master_set_filter(priv->ctx->dev, I2C_FILTER_CYC_NUM_DEF);

#ifdef CONFIG_ESPRESSIF_LPI2C
  /* Enable internal open-drain mode for I2C IO lines */

  priv->ctx->dev->ctr.sda_force_out = 0;
  priv->ctx->dev->ctr.scl_force_out = 0;

  /* Configure the I2C master to send a NACK when the Rx FIFO count is full */

  i2c_ll_master_rx_full_ack_level(priv->ctx->dev, 1);
#endif
}

/****************************************************************************
 * Name: esp_i2c_deinit
 *
 * Description:
 *   Disable I2C hardware.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_deinit(struct esp_i2c_priv_s *priv)
{
  priv->clk_freq = 0;

  I2C_CLOCK_SRC_ATOMIC()
    {
      i2c_hal_deinit(priv->ctx);
    }

  I2C_RCC_ATOMIC()
    {
      i2c_ll_enable_bus_clock(priv->id, false);
    }
}

/****************************************************************************
 * Name: esp_i2c_reset_fsmc
 *
 * Description:
 *   Reset I2C hardware state machine and registers.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

static void esp_i2c_reset_fsmc(struct esp_i2c_priv_s *priv)
{
  /* Reset FSM machine */

  i2c_hal_master_fsm_rst(priv->ctx);
}

/****************************************************************************
 * Name: esp_i2c_sem_waitdone
 *
 * Description:
 *   Wait for a transfer to complete.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/
#ifndef CONFIG_I2C_POLLED
static int esp_i2c_sem_waitdone(struct esp_i2c_priv_s *priv)
{
  return nxsem_tickwait_uninterruptible(&priv->sem_isr,
                                        ESPRESSIF_I2CTIMEOTICKS);
}
#endif

/****************************************************************************
 * Name: esp_i2c_polling_waitdone
 *
 * Description:
 *   Wait for a transfer to complete by polling status interrupt registers,
 *   which indicates the status of the I2C operations. This function is only
 *   used in polling driven mode.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 * Returned Values:
 *   Zero (OK) is returned on successful transfer. -ETIMEDOUT is returned
 *   in case a transfer didn't finish within the timeout interval. And ERROR
 *   is returned in case of any I2C error during the transfer has happened.
 *
 ****************************************************************************/
#ifdef CONFIG_I2C_POLLED
static int esp_i2c_polling_waitdone(struct esp_i2c_priv_s *priv)
{
  int ret;
  clock_t current;
  clock_t timeout;
  uint32_t status = 0;
  i2c_intr_event_t event = 0;

  /* Get the current absolute time and add an offset as timeout.
   * Preferable to use monotonic, so in case the time changes,
   * the time reference is kept, i.e., current time can't jump
   * forward and backwards.
   */

  current = clock_systime_ticks();
  timeout = current + SEC2TICK(10);

  /* Loop while a transfer is in progress
   * and an error didn't occur within the timeout
   */

  while (current - timeout < 0 && priv->error == 0)
    {
      /* Check if any interrupt triggered, clear them
       * process the operation.
       */

      i2c_ll_get_intr_mask(priv->ctx->dev, &status);
      if (status != 0)
        {
          i2c_ll_master_get_event(priv->ctx->dev, &event);
          /* Check if the stop operation ended. Don't use
           * I2CSTATE_FINISH, because it is set before the stop
           * signal really ends. This works for interrupts because
           * the i2c_state is checked in the next interrupt when
           * stop signal has concluded. This is not the case of
           * polling.
           */

          if (event == I2C_INTR_EVENT_TRANS_DONE)
            {
              i2c_ll_clear_intr_mask(priv->ctx->dev, status);
              break;
            }

          i2c_ll_clear_intr_mask(priv->ctx->dev, status);
          esp_i2c_process(priv, status);
        }

      /* Update current time */

      current = clock_systime_ticks();
    }

  /* Return a negated value in case of timeout, and in the other scenarios
   * return a positive value.
   * The transfer function will check the status of priv to check the other
   * scenarios.
   */

  if (current >= timeout)
    {
      ret = -ETIMEDOUT;
    }
  else if (priv->error)
    {
      ret = ERROR;
    }
  else
    {
      ret = OK;
    }

  /* Disable all interrupts */

  esp_i2c_intr_disable(priv);

  return ret;
}
#endif

/****************************************************************************
 * Device Driver Operations
 ****************************************************************************/

/****************************************************************************
 * Name: esp_i2c_transfer
 *
 * Description:
 *   Generic I2C transfer function.
 *
 * Parameters:
 *   dev   - Device-specific state data
 *   msgs  - A pointer to a set of message descriptors
 *   count - The number of transfers to perform
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

static int esp_i2c_transfer(struct i2c_master_s *dev,
                            struct i2c_msg_s *msgs,
                            int count)
{
  int ret = OK;
  struct esp_i2c_priv_s *priv = (struct esp_i2c_priv_s *)dev;
#ifdef CONFIG_I2C_TRACE
  uint32_t status = 0;
#endif

