streetartist/esp32p4_nuttx/arch/risc-v/src/common/espressif/esp_i2c.c
  i2cinfo("Starting transfer request of %d message(s):\n", count);

  DEBUGASSERT(count > 0);

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

#ifdef CONFIG_PM
  esp_pm_lock_acquire(priv->pm_lock);
#endif

  if (priv->i2cstate != I2CSTATE_IDLE)
    {
      esp_i2c_reset_fsmc(priv);
      priv->i2cstate = I2CSTATE_IDLE;
    }

  priv->msgv = msgs;

  for (int i = 0; i < count; i++)
    {
      esp_i2c_reset_fifo(priv);

      priv->bytes = 0;
      priv->msgid = i;
      priv->ready_read = false;
      priv->error = 0;
      priv->i2cstate = I2CSTATE_PROC;

      i2cinfo("Sending message %" PRIu8 "...\n", priv->msgid);

      esp_i2c_init_clock(priv, msgs[i].frequency);
#ifdef CONFIG_I2C_TRACE
      status = GET_STATUS(priv->ctx->dev);
#endif
#ifndef CONFIG_I2C_POLLED
      if ((msgs[i].flags & I2C_M_NOSTART) != 0)
        {
          esp_i2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->bytes, status);
          esp_i2c_senddata(priv);

          if (priv->bytes == msgs[i].length)
            {
              priv->i2cstate = I2CSTATE_STOP;
              if ((msgs[i].flags & I2C_M_NOSTOP) != 0)
                {
                  priv->i2cstate = I2CSTATE_FINISH;
                }
            }
        }
      else
#endif
        {
          /* Reset I2C trace logic */

          esp_i2c_tracereset(priv);

          esp_i2c_traceevent(priv, I2CEVENT_SENDADDR, msgs[i].addr, status);

          esp_i2c_sendstart(priv);
        }

#ifndef CONFIG_I2C_POLLED
      if (esp_i2c_sem_waitdone(priv) < 0)
        {
          i2cerr("Message %" PRIu8 " timed out.\n", priv->msgid);
          ret = -ETIMEDOUT;
          break;
        }
      else
        {
          if (priv->error != 0)
            {
              i2cerr("Transfer error %" PRIu32 "\n", priv->error);
              ret = -EIO;
              break;
            }
          else
            {
              priv->i2cstate = I2CSTATE_IDLE;
              ret = OK;
            }
        }
#else
      ret = esp_i2c_polling_waitdone(priv);
      if (ret < 0)
        {
          if (ret == -ETIMEDOUT)
            {
              break;
            }
          else
            {
              ret = -EIO;
              break;
            }
        }
      else
        {
          /* Successful transfer, update the I2C state to idle */

          priv->i2cstate = I2CSTATE_IDLE;
          ret = OK;
        }
#endif

        i2cinfo("Message %" PRIu8 " transfer complete.\n", priv->msgid);
    }

  /* Dump the trace result */

  esp_i2c_tracedump(priv);
#ifdef CONFIG_PM
  esp_pm_lock_release(priv->pm_lock);
#endif
  nxmutex_unlock(&priv->lock);

  return ret;
}

/****************************************************************************
 * Name: esp_i2c_clear_bus
 *
 * Description:
 *   Clear I2C bus, when the slave is stuck in a deadlock and keeps pulling
 *   the bus low, master can control the SCL bus to generate 9 CLKs.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static void esp_i2c_clear_bus(struct esp_i2c_priv_s *priv)
{
  i2c_ll_master_clr_bus(priv->ctx->dev,
                        I2C_LL_RESET_SLV_SCL_PULSE_NUM_DEFAULT, true);

  /* Wait for bus clear done or timeout */

  clock_t start = clock_systime_ticks();
  clock_t timeout = start + MSEC2TICK(I2C_CLR_BUS_TIMEOUT_MS);
  while (i2c_ll_master_is_bus_clear_done(priv->ctx->dev))
    {
      if (clock_systime_ticks() >= timeout)
        {
          i2cerr("ERROR: clear bus failed.\n");
          i2c_ll_master_clr_bus(priv->ctx->dev, 0, false);
          break;
        }
    }

  i2c_ll_update(priv->ctx->dev);
}
#endif

/****************************************************************************
 * Name: esp_i2c_reset
 *
 * Description:
 *   Perform an I2C bus reset in an attempt to break loose stuck I2C devices.
 *
 * Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) is returned on success. A negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_RESET
static int esp_i2c_reset(struct i2c_master_s *dev)
{
  irqstate_t flags;
  struct esp_i2c_priv_s *priv = (struct esp_i2c_priv_s *)dev;

  DEBUGASSERT(dev);

  DEBUGASSERT(priv->refs > 0);

  flags = enter_critical_section();

  esp_i2c_reset_fsmc(priv);

  /* Clear bus */

  esp_i2c_clear_bus(priv);

  priv->i2cstate   = I2CSTATE_IDLE;
  priv->msgid      = 0;
  priv->bytes      = 0;
  priv->ready_read = false;

  leave_critical_section(flags);

  return OK;
}
#endif

/****************************************************************************
 * Name: esp_i2c_traceclear
 *
 * Description:
 *   Set I2C trace fields to default value.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp_i2c_traceclear(struct esp_i2c_priv_s *priv)
{
  struct esp_trace_s *trace = &priv->trace[priv->tndx];

  trace->status = 0;
  trace->count  = 0;
  trace->event  = I2CEVENT_NONE;
  trace->parm   = 0;
  trace->time   = 0;
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: esp_i2c_tracereset
 *
 * Description:
 *   Reset the trace info for a new data collection.
 *
 * Parameters:
 *   priv - Pointer to the internal driver state structure.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp_i2c_tracereset(struct esp_i2c_priv_s *priv)
{
  priv->tndx       = 0;
  priv->start_time = clock_systime_ticks();
  esp_i2c_traceclear(priv);
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: esp_i2c_tracenew
 *
 * Description:
 *   Create a new trace entry.
 *
 * Parameters:
 *   priv   - Pointer to the internal driver state structure.
 *   status - Current value of I2C status register.
 *
 ****************************************************************************/

#ifdef CONFIG_I2C_TRACE
static void esp_i2c_tracenew(struct esp_i2c_priv_s *priv,
                             uint32_t status)
{
  struct esp_trace_s *trace = &priv->trace[priv->tndx];

  /* Check if the current entry is already initialized or if its status had
   * already changed
   */

  if (trace->count == 0 || status != trace->status)
    {
      /* Check whether the status changed  */

