streetartist/esp32p4_nuttx/arch/risc-v/src/common/espressif/esp_i2c.c
                  priv->ready_read = true;
                }
            }
          else
            {
              esp_i2c_traceevent(priv, I2CEVENT_SENDBYTE, priv->bytes,
                                 status);
              esp_i2c_senddata(priv);

              if (priv->bytes == msg->length)
                {
                  priv->i2cstate = I2CSTATE_STOP;
#ifndef CONFIG_I2C_POLLED
                  if ((msg->flags & I2C_M_NOSTOP) != 0)
                    {
                      priv->i2cstate = I2CSTATE_FINISH;
                    }
#endif
                }
            }
        }
      else if (priv->i2cstate == I2CSTATE_STOP)
        {
          esp_i2c_traceevent(priv, I2CEVENT_STOP, msg->length,
                             status);
          esp_i2c_sendstop(priv);

#ifndef CONFIG_I2C_POLLED
          priv->i2cstate = I2CSTATE_FINISH;
#endif
        }
#ifndef CONFIG_I2C_POLLED
      else if (priv->i2cstate == I2CSTATE_FINISH)
        {
          esp_i2c_intr_disable(priv);
          nxsem_post(&priv->sem_isr);
        }
#endif
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_i2cbus_initialize
 *
 * Description:
 *   Initialize the selected I2C port. And return a pointer to an unique
 *   instance of struct i2c_master_s. This function may be called to obtain
 *   multiple instances of the interface, each of which may be set up with a
 *   different frequency and slave address.
 *
 * Parameters:
 *   port - Port number of the I2C interface to be initialized.
 *
 * Returned Value:
 *   Pointer to valid I2C device structure is returned on success.
 *   A NULL pointer is returned on failure.
 *
 ****************************************************************************/

struct i2c_master_s *esp_i2cbus_initialize(int port)
{
  struct esp_i2c_priv_s *priv;
  int ret;
#ifdef CONFIG_PM
  esp_pm_lock_type_t pm_lock_type = ESP_PM_NO_LIGHT_SLEEP;
#endif

  switch (port)
    {
#ifdef CONFIG_ESPRESSIF_I2C0_MASTER_MODE
    case ESPRESSIF_I2C0:
      priv = &esp_i2c0_priv;
      break;
#endif
#ifdef CONFIG_ESPRESSIF_I2C1_MASTER_MODE
    case ESPRESSIF_I2C1:
      priv = &esp_i2c1_priv;
      break;
#endif
#ifdef CONFIG_ESPRESSIF_LP_I2C0
    case ESPRESSIF_LP_I2C0:
      priv = &esp_lp_i2c0_priv;
      break;
#endif
    default:
      return NULL;
    }

  nxmutex_lock(&priv->lock);

  if (priv->refs++ != 0)
    {
      nxmutex_unlock(&priv->lock);

      i2cinfo("Returning previously initialized I2C bus. "
              "Handler: %p\n", priv);

      return (struct i2c_master_s *)priv;
    }

#ifdef CONFIG_PM
#  if SOC_I2C_SUPPORT_RTC
  if (I2C_CLK_SRC_DEFAULT == I2C_CLK_SRC_RC_FAST)
    {
      pm_lock_type = ESP_PM_NO_LIGHT_SLEEP;
    }
#  endif

#  if SOC_I2C_SUPPORT_APB
  if (I2C_CLK_SRC_DEFAULT == I2C_CLK_SRC_APB)
    {
      pm_lock_type = ESP_PM_APB_FREQ_MAX;
    }
#  endif

#  ifdef CONFIG_ESPRESSIF_LP_I2C0
  if (priv->id == ESPRESSIF_LP_I2C0)
    {
      pm_lock_type = ESP_PM_NO_LIGHT_SLEEP;
    }
#  endif

  ret = esp_pm_lock_create(pm_lock_type,
                           0,
                           i2c_periph_signal[priv->id].module_name,
                           &priv->pm_lock);
  if (ret != OK)
    {
      priv->refs--;
      nxmutex_unlock(&priv->lock);
      i2cerr("Failed to create I2C PM lock."
             "Handler: %p\n", priv);
      return NULL;
    }
#endif

#ifndef CONFIG_I2C_POLLED
  if (priv->cpuint != -ENOMEM)
    {
      /* Disable the previous IRQ */

      up_disable_irq(ESP_SOURCE2IRQ(i2c_periph_signal[priv->id].irq));
      esp_teardown_irq(i2c_periph_signal[priv->id].irq, priv->cpuint);
    }

  priv->cpuint = esp_setup_irq(i2c_periph_signal[priv->id].irq,
                               ESP_IRQ_PRIORITY_DEFAULT,
                               ESP_IRQ_TRIGGER_LEVEL,
                               esp_i2c_irq,
                               priv);
  if (priv->cpuint < 0)
    {
      /* Failed to allocate a CPU interrupt of this type. */

      priv->refs--;
      nxmutex_unlock(&priv->lock);

      return NULL;
    }

  /* Bring the peripheral up before the interrupt is enabled.  esp_i2c_irq()
   * dereferences priv->ctx->dev, and that pointer is only established by
   * i2c_hal_init() inside esp_i2c_init().  Enabling the interrupt first
   * lets an already pending I2C condition invoke the handler while ctx->dev
   * is still NULL, which faults on a load from address 0x2c and takes the
   * whole boot down before the desktop appears.
   */

  esp_i2c_init(priv);

  /* Enable the CPU interrupt that is linked to the I2C device. */

  up_enable_irq(ESP_SOURCE2IRQ(i2c_periph_signal[priv->id].irq));
#else
  esp_i2c_init(priv);
#endif

  nxmutex_unlock(&priv->lock);

  i2cinfo("I2C bus initialized! Handler: %p\n", priv);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: esp_i2cbus_uninitialize
 *
 * Description:
 *   De-initialize the selected I2C port and power down the device.
 *
 * Parameters:
 *   dev - Device structure as returned by
 *         esp_i2cbus_initialize()
 *
 * Returned Value:
 *   OK is returned on success. ERROR is returned when internal reference
 *   count mismatches or dev points to invalid hardware device.
 *
 ****************************************************************************/

int esp_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct esp_i2c_priv_s *priv = (struct esp_i2c_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

#ifndef CONFIG_I2C_POLLED
  up_disable_irq(ESP_SOURCE2IRQ(i2c_periph_signal[priv->id].irq));
  esp_teardown_irq(i2c_periph_signal[priv->id].irq, priv->cpuint);
  priv->cpuint = -ENOMEM;
#endif

#ifdef CONFIG_PM
  if (priv->pm_lock != NULL)
    {
      esp_pm_lock_delete(priv->pm_lock);
      priv->pm_lock = NULL;
    }
#endif

  esp_i2c_deinit(priv);
  nxmutex_unlock(&priv->lock);

  return OK;
}

#endif /* CONFIG_ESPRESSIF_I2C_PERIPH_MASTER_MODE */
